[PAD]
[UNK]
[SEP]
[CLS]
[MASK]
3750
648
900
3370
6122
4464
7399
4939
3659
4811
5598
669
2400
5560
2465
299
2109
4893
4411
1699
1519
803
1635
6065
5998
1903
5445
2376
1324
340
4659
3800
5948
1460
1985
6017
2614
1465
3961
5393
4853
2210
5977
5602
6250
3700
2799
4516
2252
7543
4646
1633
151
6357
619
7539
3915
5410
6093
7495
913
4128
5620
5780
5915
7194
3223
2073
307
1375
4149
2662
2490
5491
4490
5296
5036
4269
5858
2106
5330
3686
1394
1667
3099
465
5430
5176
6045
2539
25
1866
4704
6038
192
4559
1141
1080
6248
5028
3272
1567
6831
4190
3618
6104
2859
3374
1702
3166
7010
3605
4525
4822
2119
6407
1099
3530
5659
3772
5510
5589
531
7186
5619
6644
2986
1407
6637
4480
3641
4063
1906
1920
1722
23
2515
5677
5689
5778
5736
910
4124
4167
1767
5011
1070
5310
7377
2212
5612
7509
2595
1736
6835
1018
5537
3263
1363
281
3809
3220
1277
3743
3893
6887
5566
1871
4958
742
2289
2541
2555
4969
2107
3300
2265
2597
6040
5949
6242
4151
5057
486
4409
512
3870
1066
1854
5096
2313
7467
7261
4562
7492
62
2828
5470
7058
4109
5051
3747
7346
6508
2112
7044
2693
5526
7239
3068
5702
6810
6832
4392
3661
7123
2489
2364
2380
1731
1679
5264
3694
4211
6734
3859
6333
6929
1734
6630
6980
6293
6759
6983
4936
2729
1815
1215
6286
1344
4576
6656
1401
3560
1913
7305
4721
3568
5530
7055
1031
7444
2770
761
5520
2304
4231
3792
2538
5284
150
3634
2461
2549
6641
4630
5037
2975
6501
1647
3630
6101
2087
1877
2967
3193
7370
5271
1036
4230
4498
2410
2471
4655
1859
3038
2621
5640
2827
3196
3706
1362
730
4139
3154
4148
2197
4293
4301
3433
6301
3000
1779
1348
450
1279
7039
6453
3335
606
6609
3780
6206
3586
6289
2147
544
1334
5718
1726
4068
5122
4967
2446
2466
3864
623
6770
7255
4216
2058
4333
2717
1641
2923
2674
6469
4933
5282
1264
6714
955
6405
4261
6822
2810
6713
2456
5450
4350
1271
3578
5328
1816
2402
3440
4462
3317
6920
885
2786
3523
6811
7309
4671
290
4499
6909
4412
433
5192
5681
2115
5538
7160
1844
2791
7328
7449
19
922
478
264
3067
408
3692
134
5724
3912
6654
2444
670
6485
5787
3397
7403
7349
541
6178
5041
4599
5338
2891
94
1241
656
3976
7212
893
4326
872
3971
868
350
133
6012
3018
4181
4321
4173
2192
1952
7159
4180
4902
4417
2463
535
2151
5139
4117
1610
6521
4298
6227
6352
1511
2685
4744
3607
4407
2899
4089
6666
1605
2226
2695
2435
2154
4233
671
1582
3585
5178
5397
4531
7400
3242
6740
1219
4105
4923
2974
5864
5505
2282
2042
4125
6966
7486
7256
790
1258
4866
2522
4046
3695
1695
1580
6569
7154
5165
2477
6050
4080
5955
4981
4998
5547
4612
3504
296
6861
6919
6088
5889
5906
3329
5519
2029
4650
1571
116
965
383
2612
4510
4469
3461
1970
5971
2021
4145
6833
3765
3648
4568
3137
4430
265
64
826
5938
6518
6846
4355
4396
5006
3203
1934
4741
2993
5292
2396
5498
2121
2315
3373
4166
7408
3508
7363
3901
5698
314
330
1660
2848
6722
6319
6143
4291
1457
343
4780
6886
3106
5744
2448
6689
248
847
1999
5497
5708
1146
2205
2004
736
5099
532
1227
137
1323
2506
3117
5235
6014
5999
5166
2990
7037
980
3764
5810
3770
6350
3056
5788
3231
4909
5920
3464
7528
1116
751
4986
7420
2970
6535
920
5816
4653
507
3500
3012
3342
1283
3945
1592
3007
663
1308
4802
794
2688
7465
3824
5926
6182
1395
3937
2255
3289
1919
3310
414
1335
7047
7257
2334
1706
6596
6160
584
565
88
4553
5521
5988
5105
4381
1613
7013
4351
1778
3495
419
4751
5370
2984
4114
6043
7354
810
517
6798
974
4042
5226
4819
1043
6854
591
1951
5413
827
4760
5221
600
7006
6902
7327
2499
3019
5909
1924
1684
101
6768
6678
4237
4450
4399
3366
6223
2592
6220
1245
3731
2738
764
1405
3255
2851
6985
3051
127
7436
7251
5803
6284
6235
1724
1351
641
1688
2968
4053
5562
5814
1214
2007
2348
2716
5251
3084
2835
3644
220
7023
4369
2331
4315
4677
1735
2570
138
5492
3646
3477
3017
3725
1315
6930
7366
4603
1132
2378
4583
5063
5984
3481
1899
4768
3396
2528
5081
6165
2918
144
1152
4302
5791
3819
5957
1629
7134
983
5688
53
6602
211
6962
5179
2983
2838
293
6751
1697
6163
6651
2218
4220
2769
304
3283
5117
5839
2316
3134
4040
5801
6176
5693
6973
3227
6515
979
462
7127
6977
3377
3186
4543
6567
7091
936
3097
7077
6725
2407
3247
1379
543
1879
3364
6027
734
1914
7532
7421
6662
1255
1170
902
6308
569
3956
5095
26
1103
4542
7042
56
6899
3987
4036
6695
6015
6760
3128
1730
7373
2230
5881
4858
6560
4595
3501
1889
873
6115
2367
6552
316
6007
7490
3844
6003
7147
4202
5389
894
495
2328
2131
812
3529
2722
6583
2602
4786
5854
2229
6314
3129
5775
5860
7019
3531
404
4287
3938
4779
4458
2505
6613
1805
4558
499
4454
5997
6908
38
442
4329
3775
3654
5603
5511
4372
578
3032
197
4340
1991
5005
69
5623
6482
431
1327
1247
6663
1061
5660
5288
3130
1299
5466
1388
7344
4377
7326
7292
4021
1292
5168
2076
2318
3598
7206
2283
212
4648
1252
3613
3615
1168
3665
7032
5396
5882
245
2399
2099
7330
6167
5617
7125
6968
1623
2211
3949
368
4636
6972
3198
3860
4163
6639
6729
5741
5243
7219
1267
1757
4223
1590
2935
6588
3270
6615
5239
3691
1693
5486
6362
4547
2699
1939
4403
3873
3299
5381
2683
4130
3090
4921
6549
1622
4205
5298
5436
6047
1960
6004
83
6543
6940
5385
3456
3107
4183
3469
6631
3120
36
443
948
5335
2397
7458
3226
4876
7507
869
5495
3015
4354
4679
318
3608
3515
3762
7445
7395
2023
6551
2491
1154
5573
1205
3771
1891
4003
3994
1232
5604
930
5883
7078
6986
657
2741
1819
1987
1946
2776
1274
355
6875
2642
1250
3606
1616
1148
1846
4842
659
3782
2434
5395
219
2873
5367
4305
7157
7029
7371
4643
957
5422
141
677
7180
2484
1936
1670
5305
1793
7025
3484
3418
5606
5594
4203
2181
5089
7121
6192
4544
5480
6193
6888
2663
5678
6758
4120
3070
6066
6890
3066
4894
1953
6587
652
6390
1715
729
4413
7117
6063
7254
3577
1129
7393
3148
1006
5822
2847
6649
6674
4118
7250
7059
1370
3021
5658
2502
4587
1397
2745
5194
7533
6149
361
3442
1814
5482
3088
5936
632
6671
4214
29
349
2060
3155
57
580
5731
6393
7033
3040
3811
2145
2495
4378
3783
5935
4691
1121
781
2727
463
6959
2919
1972
78
2795
3062
7546
6221
932
3466
5647
1746
6046
763
583
5821
4491
7329
5109
6905
6917
3151
470
6417
2124
7311
6625
4270
1518
7419
2594
5278
2012
5493
5649
5484
4641
3172
3213
2512
5169
6243
5472
4486
2221
2766
993
3159
5229
1110
6444
3744
3479
6881
1698
3104
3436
2655
1386
5705
3703
1782
3055
445
1078
1743
216
382
177
7038
1361
2411
1750
2080
4628
2196
3720
5426
6704
3400
5535
1500
2708
341
5574
886
5610
4199
5203
5631
5322
2130
5402
5555
1569
2035
3354
3039
2610
4122
6981
1744
5202
405
2646
3112
7110
3168
6079
2164
7447
6898
6296
3943
2576
5695
100
2028
2730
1865
4065
3482
2524
7045
45
1963
2393
3506
1907
252
3257
6542
6356
5950
4683
1302
2024
2936
686
796
5134
3215
1941
2091
4778
7075
6748
180
6447
5525
4993
4941
1081
1618
43
4482
811
6788
2421
3813
415
3126
5663
6325
4829
4626
1294
768
7544
628
5600
4987
3766
1206
4832
6862
6127
1956
5648
3312
2511
5986
5870
3189
1915
2910
6236
903
6078
4693
2429
7129
7192
5121
13
1390
292
6682
518
6037
3080
3651
5333
4784
5964
5380
2415
1425
4289
2768
84
3030
5277
5872
4861
998
2267
1100
5739
6298
2279
1545
5728
6389
6111
5502
1732
1389
5295
4005
5536
750
1829
5085
4974
832
4590
5160
5064
1995
6894
7387
6992
7378
317
5289
2354
2423
4225
7137
2749
1459
4218
1853
2437
7122
851
5683
157
5056
1833
6864
1515
5474
366
7451
2931
7360
6493
4848
5190
654
1566
2120
3955
5850
889
505
4851
5644
5847
3103
1014
7144
2626
6965
239
5770
3650
1516
848
4976
7152
5374
2198
4123
4030
3438
2480
3318
571
4017
1270
3793
5513
6658
5416
5369
7541
6994
634
7106
5799
2842
6324
182
2329
3705
7548
2274
18
4505
6571
1160
5716
6203
1508
2370
3324
6139
5613
1151
6414
225
2879
3512
3836
5504
2022
938
5153
2771
4686
1242
3681
7527
4260
6346
58
6600
566
1777
2046
5234
5469
4245
3182
3724
2346
384
7295
3268
1839
3878
1542
5217
456
2525
2483
208
4592
3049
339
1721
6398
4106
1211
1775
3343
2234
3285
2049
3711
6375
4781
3563
5076
5899
879
5208
420
1620
515
6265
7394
2866
3966
856
457
760
4988
6683
2030
7477
5968
1965
2656
3073
986
3209
7028
1640
4699
2047
3170
4144
2248
6164
4448
5184
6906
7051
4324
4375
1885
667
7317
3053
2603
5488
6441
3248
4917
5399
5777
1166
1835
3533
1158
4878
6360
4874
660
1883
482
7213
1057
4906
2127
6175
6445
6119
4836
2976
5026
2275
5651
1402
4002
7383
676
4150
2519
3503
3407
3818
1087
1291
908
3319
5254
5694
4429
2473
4022
5621
2785
7475
3749
3004
4108
5361
2070
4597
2564
1758
4927
459
2998
4743
1304
2474
4334
6283
4188
5804
1176
2068
2214
7362
4971
6327
1832
7148
3472
5144
1588
5793
5459
5281
3309
5411
2379
6133
4257
4061
3238
3627
2667
3978
2908
489
6511
7513
4758
6889
3414
4335
4718
788
1855
3784
3362
2647
2369
554
394
2702
4662
2273
4337
5257
440
4018
1480
1022
2841
2487
6956
3988
2728
4700
7088
3111
6311
4278
5242
7008
4928
3444
4274
3430
426
4801
6272
5514
853
2556
6158
1265
1174
4436
7479
5917
3689
7000
6575
5033
6011
672
6267
2327
3620
740
4475
2620
6141
2762
802
2867
7062
4680
347
6996
4097
1060
247
777
5297
4386
4794
1360
3576
2942
2709
5347
4567
7069
2563
5624
3718
2638
5542
6287
3359
1111
2862
5004
6490
4176
2732
6574
4934
1452
5811
5316
791
3717
5348
2648
6817
4152
7111
2439
5468
6396
5785
1977
5477
778
6640
14
4831
5052
7238
496
5918
6161
4249
7164
1325
5886
3740
5922
7417
4657
4841
2233
1657
758
1603
6252
4478
3360
2420
4871
2406
3489
6402
3110
227
7175
5834
4719
2272
895
3583
5247
4750
1343
2820
1320
572
1289
7520
945
5931
519
3212
2979
3842
1827
1514
5591
1818
5125
1076
6474
5501
3158
1268
4968
1656
6454
4536
6825
1428
3349
498
2586
5034
194
2458
60
5269
550
485
2639
2988
5391
2453
6680
5638
1737
4709
4070
238
3742
6234
1471
5684
2686
5406
7234
6802
1696
4119
5641
1638
1122
6337
3351
6318
4153
1858
6818
2756
3173
1220
5368
7462
2428
4732
2818
2680
6738
7224
5306
1350
536
6895
1565
1764
244
6976
6427
5017
6054
3899
226
1564
2558
646
6681
4775
5308
2582
2772
1008
1352
4366
6780
2188
4402
3420
2479
2019
581
2425
4083
6754
2644
697
4276
5581
2382
951
4431
7375
3181
1917
4052
4908
5136
5753
5746
3921
6946
4007
136
5047
645
6610
4280
1981
203
6819
1112
1504
5823
4970
2185
4835
2330
1973
746
2682
6431
3059
4675
3851
6380
4374
4285
5709
4191
3545
1964
2290
6512
4157
3982
7510
1474
4930
3125
6144
5438
4960
3344
5383
2169
6087
3745
6000
1107
4728
3005
5189
1287
3036
1587
6211
978
7016
5928
3336
3886
816
2914
7109
4515
1760
631
1783
4479
1096
2987
5773
2247
3425
6391
4232
2179
4707
2431
3095
1986
455
1184
3781
3727
6916
562
2350
4736
7210
2567
3580
1396
289
1604
5087
1090
523
6947
3267
5686
5592
1550
5824
2999
8
6423
4466
167
4560
5656
1314
1391
3161
3821
4717
2740
6897
3290
4077
4460
5972
5776
4439
3845
4929
5961
2591
7207
176
1419
3657
5000
6922
561
7241
5213
5815
7043
4275
2363
6928
843
3517
2526
327
7454
5206
490
1536
2673
1842
3152
3626
4951
3679
5884
2514
4690
4267
7196
2055
6355
3150
3093
2540
6171
6471
2017
3147
5420
452
5572
3338
3002
5691
3544
2508
4922
5371
7017
699
4082
5532
1243
3934
4313
926
1050
1127
2831
3795
5862
4762
6800
1497
4989
785
7540
4782
7156
6635
268
7097
5423
6781
2011
970
2893
1266
1606
2005
5344
4627
2863
1950
2566
6892
2438
6565
5929
7335
513
2190
7265
5868
1195
7525
5475
5960
2266
2724
1678
1424
3923
2366
1073
5979
5969
1690
560
6016
4357
5127
2202
54
4729
5769
1888
6295
1373
4582
4796
6387
3326
6842
732
2572
7496
6507
6720
4265
1435
1719
7512
3435
6057
2530
4461
5233
1142
5954
1540
6256
1295
6134
1002
152
3266
752
4006
4912
7452
4767
4695
5200
5618
4194
2804
5182
981
2209
3167
3455
5907
5937
6504
35
5118
3643
4169
430
881
4614
4745
438
6108
399
4310
6855
3253
4034
6500
5720
6430
4090
159
4493
3778
5529
795
7222
6036
1791
3207
715
7483
743
5360
6487
1718
1755
4761
592
3079
5215
1892
2293
338
3914
6436
642
195
1013
1510
2857
418
5214
2995
3554
4442
1092
3020
1047
2144
1780
218
4512
3232
3327
7426
6694
5900
1902
1453
6750
711
4748
6730
3614
3403
6799
1431
7391
7339
5552
6055
3905
4814
1631
5050
6608
7245
2876
3603
6472
4255
4356
1940
1440
6562
6621
178
4757
6838
3729
326
4985
6829
817
5273
878
7169
3177
7150
3200
5869
5956
7353
1619
4873
4476
1741
4380
3951
859
5940
17
2103
7183
4506
7380
6971
300
7493
5518
4444
6197
2351
1200
2761
2136
5715
2852
950
253
1124
1556
4066
5020
2691
6764
1905
5467
3113
6796
234
3494
7098
3528
5212
3850
5571
757
739
3952
1671
7208
1023
1745
214
7197
228
6582
1260
789
4500
2260
3385
1065
611
6513
1042
5274
7529
4991
6510
156
2710
413
1071
119
3662
6702
89
3868
4504
5792
1916
2341
1651
240
1502
3716
3647
3649
1086
6303
6815
2178
1297
6189
3910
6032
7404
3992
4323
1164
2924
2714
5690
6347
6870
4940
7300
4887
555
128
2240
4358
7225
4004
3977
6690
962
1868
3983
3262
4405
5156
2138
3280
1423
3946
4742
6517
2345
4862
2734
5003
4408
5636
6830
2139
7226
6804
4055
5714
5673
2713
7001
332
1221
4611
2468
4766
354
4382
1191
4556
3141
6914
1251
988
7453
3345
7015
2832
254
1273
5340
6675
1769
3371
3856
2394
2581
6056
1332
2140
5258
4914
2631
1838
266
4575
5442
5255
6254
2236
2231
5398
5595
7299
6467
3054
4031
3918
7272
3617
2056
4262
4514
5635
7131
3610
4234
337
4651
5632
5548
2739
3411
2156
780
1639
230
727
3313
3052
3925
6198
112
6364
7410
4777
2172
6784
1326
7034
3273
6570
891
2653
3855
4896
7501
741
3225
6757
830
367
5315
377
1609
964
6404
1140
3096
3897
733
6989
7170
4973
4509
1416
5668
22
320
5894
6812
5317
5177
5082
6335
2945
839
4731
6059
145
6199
1928
2422
4715
411
4961
1691
4623
529
5723
1105
6893
610
6067
403
7464
3447
5974
6135
7116
4720
6386
5092
7096
2562
122
3848
61
469
6377
3941
805
4555
1278
2925
5895
5325
1163
2307
1364
397
149
1449
476
428
1547
425
1645
1826
1822
4624
5379
956
2054
5865
1627
5861
473
2359
1055
2958
2561
4864
2044
187
3416
3146
724
6244
500
3622
6941
3631
373
6151
5970
1306
3758
2069
3998
7505
3121
4012
3917
2401
6338
3807
5829
3011
1072
3451
3233
4440
315
4615
6277
285
2964
7086
959
5614
3294
336
4949
4716
1538
5228
2875
1486
2000
4903
5512
5205
7442
2064
4548
7190
5697
4353
7282
1648
5752
854
3825
5129
2571
7424
533
2356
3306
3969
4497
574
1848
4660
5094
3022
823
1984
4565
7168
372
6845
975
2874
1347
3732
3320
7333
2457
2972
6949
3999
722
2598
1068
5429
7350
162
6379
6473
4771
5873
939
3746
3406
5
2523
301
7534
6633
4549
720
3866
6094
3304
6062
6636
6591
2950
2189
6878
3721
4410
2629
7310
1235
4889
907
4652
1598
5813
7289
76
7031
6126
6450
5892
6307
4911
1694
449
6424
1102
7491
1831
6749
3057
3565
2098
2237
6769
1171
5392
6718
6142
6329
5941
6266
3728
5418
3459
3664
6257
2902
3929
360
933
2288
5059
395
6932
5433
621
4956
2472
1341
6262
5876
3521
3676
946
4658
698
6807
6083
1614
577
6937
3254
5133
235
2391
1234
3194
6292
2547
3869
6753
3108
7012
7515
7185
1733
1958
4843
257
2604
3567
3986
5607
3265
297
5578
6085
3536
2358
2917
3127
5456
674
1676
2778
4799
7368
2798
6790
6611
1044
3668
4950
1579
644
4557
3483
1563
2513
6660
804
5634
3829
3894
679
3973
5840
3271
2299
5903
682
1870
5010
6771
960
2721
2809
5874
707
2141
5540
1411
207
2228
1529
3562
6809
1509
1787
103
6762
2447
564
3083
6848
949
3653
4172
2132
40
1089
710
7440
1959
1451
5417
1849
4096
3346
1931
1248
4093
6497
5071
5074
579
7361
6435
1406
1544
5963
3683
4872
7381
7411
1938
7214
3595
4852
5287
3144
5762
1727
2102
713
2310
2901
2636
1728
762
1208
6840
4258
6174
6852
6850
5580
7423
1417
3109
5137
3328
3990
1000
2170
1710
4451
1033
181
1901
4924
2705
302
6684
4574
5887
370
6557
806
852
1716
3445
6233
770
3
7162
6128
1669
429
3340
5107
5596
7188
7306
2381
3871
7422
3670
2027
2765
5115
4578
6697
7223
6847
3131
7469
850
1489
1199
1307
4048
3907
1792
2284
5719
5362
6545
2938
7531
1339
2253
1309
3572
5123
217
2337
2929
5674
2814
1366
4517
6020
3628
4299
447
6868
6924
175
3518
468
7181
324
3258
5901
6522
5921
5471
1811
7216
1180
7046
2
5013
6491
688
4996
4273
6113
4295
6506
6785
3975
5856
4763
6882
753
958
3779
5210
1441
2419
1179
7318
2239
1674
4606
5093
7202
7523
2510
728
2249
901
3723
3965
2374
1650
604
3714
1890
3812
2123
6348
6921
6988
4722
4712
5293
3216
125
2679
2781
5405
67
622
5382
4300
3277
1966
586
1045
2067
1173
2531
896
3160
3558
5018
6116
6214
1878
1182
1384
72
7446
115
323
5733
1275
6900
1298
3415
2232
5106
6328
1157
2892
797
1595
5751
6237
3023
4776
6563
3655
1466
4168
2706
81
2930
7494
2220
4999
4416
5932
174
2285
6156
5114
835
5008
2956
1682
4078
5256
875
1532
1608
551
2478
5149
6
927
4870
5533
4390
2652
2939
417
3047
6866
2985
6185
3889
1212
3900
4640
2640
7277
1874
2250
3903
5951
2812
684
3391
7294
2485
5001
1010
4164
6091
3334
6733
98
2038
4992
1433
2291
1482
3139
6661
2787
3487
651
1082
3427
6279
110
3960
4788
1093
6181
1038
2504
5404
6191
7093
2669
4702
5478
1812
4676
6023
2689
3754
2166
2565
3814
1661
5687
59
887
2937
912
483
653
4522
204
6231
6782
1643
4916
5431
1525
1685
2911
2278
1172
2905
3833
250
6843
4175
6229
6313
5452
3499
5546
2692
6460
2194
4155
5601
1128
7312
2947
4824
6238
378
530
283
1272
2944
4696
509
6455
1900
3698
479
4817
5754
1751
3667
5549
5797
7061
709
5978
1358
6594
2953
5097
6958
118
5311
693
1948
2045
1823
1978
2703
4437
5952
7535
3426
5848
7519
7285
233
2006
2224
7301
1004
3046
3443
3542
7405
3526
4059
1921
3311
4730
5241
6580
3462
5476
5779
1546
386
3940
5261
7179
5171
5337
4014
5487
3006
5088
6857
952
165
2113
3854
5461
5738
3153
3570
164
1594
4419
4584
4821
6140
6369
2268
106
6618
1753
1599
3756
5796
6316
1496
5186
5517
4015
2321
7094
1481
700
2965
5650
4759
5352
5527
4854
2796
1961
2752
5622
2634
3325
5147
5556
7498
3449
7084
7332
7345
1067
7459
4239
7514
1414
1809
6099
2665
4790
6147
6334
2167
1700
2297
4774
1458
3557
4250
4494
5758
3592
5494
4304
4789
246
7050
3947
5902
7342
7542
943
1041
1478
2395
3348
3297
681
7499
5152
7074
1084
3063
3808
6896
1108
3003
1398
2105
5575
3275
2339
2616
421
4812
5637
2008
3383
2117
2032
4263
2057
4
7275
5819
2182
7215
2389
213
504
7288
1923
731
5174
1196
5120
5947
1522
3428
1909
4572
5885
6153
400
2390
74
295
3408
4982
2834
5019
6805
5545
7060
3571
3805
5039
5207
3474
4619
107
2529
6406
553
7336
3596
5544
1296
5032
5993
7149
1856
5608
844
1864
5079
502
4667
1367
2254
4880
7478
635
4954
2641
3984
6370
1028
605
95
1840
2496
620
6294
963
3044
3157
774
7545
385
6385
6679
6787
4837
2432
5703
2615
4420
6481
5506
5628
2227
6939
2455
3722
3797
4279
6304
1383
1378
3081
6084
838
4856
5286
6275
2963
6533
3368
4793
2033
4642
7100
1165
2527
4110
198
3376
7163
5270
2864
4423
158
286
2946
5191
1555
5113
3251
3392
5197
4397
7412
82
3822
7313
558
1413
6408
7448
6219
6372
7537
2632
2163
4739
5223
5443
612
6400
3734
2596
1615
6107
2966
2559
4705
708
7120
5657
6462
6998
2940
5366
2223
1485
1662
3485
6659
7243
4133
4897
5040
6100
6264
2583
3776
841
1256
3696
3249
3308
3535
3190
6031
4428
4879
3785
4035
4975
7461
3234
1056
1186
5183
831
4342
1861
2623
5054
1720
1880
2036
1126
1353
4875
6259
3767
2550
3882
5835
5995
7118
2811
643
4297
2168
2336
2780
4178
1993
510
5563
1749
2507
5851
70
6463
6475
3967
5939
5781
1976
2039
2535
2915
3733
5783
2149
5263
6002
3957
755
1225
4749
1630
2951
3763
5387
104
5696
745
2897
3058
779
1725
185
6026
1794
3087
7303
2637
6064
1664
7067
4131
4957
4051
6786
4221
1908
24
2440
6696
3496
1461
1467
6345
1442
2079
260
424
6483
4088
4596
7365
1083
2855
4545
168
453
5111
2996
4963
5128
4521
4978
4844
7177
171
6874
4094
783
2659
407
4638
2470
1573
345
4907
79
2922
5567
6828
2800
3184
4081
1175
557
590
5825
6539
7171
1543
4580
3625
3931
602
7101
6918
7103
3217
525
16
782
1828
3534
5625
5962
6960
2065
944
4198
6821
7500
3959
7286
2043
2912
1873
3179
3769
7227
863
191
6974
4885
7142
6667
2894
3419
7364
2347
4834
1761
545
6013
6712
691
7176
7414
3753
5732
4171
540
99
6365
4995
5131
7036
7409
1517
3315
6546
1752
1763
4266
714
4534
7191
7203
2613
169
2973
3115
4966
5890
5942
918
3219
539
1188
416
4395
4826
4944
5990
673
2599
6358
3710
1882
3412
4363
232
4327
6439
6544
3936
6150
2081
4103
5162
615
2978
4797
5669
6616
1432
2606
3286
3393
3708
261
1040
4487
916
6954
3132
6418
5193
6162
6531
4809
7066
1409
4215
4513
6239
1742
3243
2568
2775
3804
4895
5259
7236
2129
3208
1686
940
1032
1974
2575
3379
5424
75
2751
4529
570
123
2503
4137
6058
1005
2089
52
5944
6232
3086
358
6556
1007
2672
6392
6534
143
5246
695
2100
6686
6727
7184
1410
2460
7304
994
4050
5652
2146
5349
7530
6323
1576
3331
5415
6486
3827
1475
2162
4689
6388
7266
2789
1666
2025
2320
2707
3933
6622
2830
5855
369
6001
7187
3025
4492
5376
4639
6429
2718
2332
6039
1189
2187
2241
5067
3048
7115
2955
4008
501
6188
1336
1559
3911
2155
3061
4663
5421
5457
1426
1713
1570
5806
124
2449
5048
5898
3246
196
582
6614
2219
3045
599
2257
448
4581
5262
5444
6326
2546
1236
1492
5561
7473
1030
4079
4610
4935
5195
690
2992
48
6646
799
3974
4918
5727
5761
2880
3034
3735
4314
7470
1652
277
4467
4850
6249
3806
5341
1201
1801
6632
267
3375
5981
6129
7341
4882
5388
6155
6415
3078
3693
7124
864
6499
6883
3611
6584
3178
5154
6033
1436
1910
288
3801
4538
5818
2096
222
6359
6595
2404
5151
6090
6502
6834
4177
7228
2003
209
3492
5237
6019
3922
6166
7334
3218
5713
6527
3323
4827
5692
6130
1575
2063
2152
4424
4752
5772
7248
793
967
4206
4288
1281
1285
1935
5086
5353
1246
1400
6110
3457
4530
4681
6112
7014
888
2110
3538
503
3413
4507
5022
2183
2195
3071
4189
7235
7356
7441
5407
5409
1672
1796
2413
2664
3876
4000
5653
2426
2492
6190
6904
7369
1625
492
6096
744
6461
3847
837
1162
2486
5959
6255
6420
312
3604
2160
3826
6744
678
1887
4528
4919
5201
5807
7389
139
2980
637
93
1149
3522
432
6528
3541
6041
6154
3192
4060
4254
5774
3369
5679
5857
6035
1768
5667
5680
6204
6664
1456
1954
3468
3788
5812
1847
344
4062
5933
6200
6564
7536
1178
1328
3537
4433
6218
6950
2026
4383
1046
3042
5808
3669
5249
5304
6225
704
117
4649
2078
2712
2927
5605
2352
4376
4449
4942
6955
202
3581
472
5924
6488
7517
1357
1527
2398
548
5685
898
1943
2200
3964
4165
4477
7406
1254
1860
2701
3010
5155
6247
6858
1305
3602
4654
4694
5102
1377
2774
2957
3228
4185
1843
2657
3075
3347
3624
4243
6049
6912
7141
3794
6103
1382
2758
3041
4074
4364
4635
4984
617
6576
7258
303
6022
6477
941
996
1677
3493
4607
4926
1387
1533
2670
7274
821
2806
2819
3136
3388
4604
6240
7200
2225
5551
6820
1365
3561
6726
6877
6957
858
5163
5276
7182
1313
1557
193
32
3707
5108
6708
1632
2731
2794
3507
4368
4937
4962
917
924
1404
1925
3547
3857
42
4625
7048
3924
3954
528
7252
2943
4979
6121
6195
6526
7049
976
2878
2933
3065
5717
1654
2114
2243
3549
4311
6931
389
461
4898
5541
7151
7189
987
1499
5905
6102
6371
7398
1190
4343
588
7114
201
4041
4229
4348
435
2031
3566
4983
1097
1537
911
1037
1658
4539
4585
4618
6434
6561
1230
2607
3573
4016
6529
1109
1810
20
6746
7229
845
921
4159
1125
3551
3736
1493
3454
953
1088
1637
4422
4997
6624
765
1572
1802
2793
3591
6867
721
7244
3016
3791
5836
5927
6184
7064
7508
1216
1642
1872
1894
4723
5080
5666
573
647
2048
359
4025
4550
5584
6401
6741
1059
2754
3239
961
1601
1634
357
3838
5481
706
7230
10
2521
3240
34
4033
4901
5615
5805
1817
2126
3188
3757
4196
4953
5266
6194
1177
3556
4904
7432
1130
147
2443
393
4158
4174
5967
6331
1159
1346
1636
1740
1857
2309
2409
3237
4401
4783
1837
1851
1867
1988
2601
2649
3423
6263
862
890
1003
146
5384
5609
7516
1213
305
4142
4242
2083
2537
4756
4884
5671
5896
5994
607
3124
3550
4312
6117
6880
3680
3867
4865
627
6366
6520
1712
2408
2697
4038
4365
4569
5425
5646
6458
870
1218
1789
2587
3140
321
4186
5062
5664
6440
7081
242
3409
3660
3666
3958
4001
4026
4098
4385
4533
6105
749
2534
2840
3206
3417
5219
5342
7138
2335
4341
5016
5735
613
6525
6739
3332
3453
3597
4347
5272
534
718
1535
231
3116
5706
6074
7158
973
1422
1541
1611
1762
2849
5586
587
6736
1506
2261
4092
4349
5722
5786
6217
7135
1209
1421
2733
3357
3875
4785
4857
4932
6177
6604
668
675
7
1012
3013
3588
365
6341
6601
7237
4344
4481
4737
5725
6124
6261
6397
6936
7416
1490
1933
2134
2377
2635
2737
3260
346
6538
6961
7502
1445
3759
4682
6208
6590
6871
7022
7056
7139
1257
2609
2898
2952
3511
3908
5755
6677
6773
798
1646
1863
2088
2627
65
6514
6806
866
2590
2755
3381
3579
3935
4485
4740
6028
6952
696
1053
1342
142
1443
2821
3991
4362
5303
1593
2111
3105
3394
3527
4200
4990
50
5500
5503
6428
135
190
3072
3175
3843
6309
822
1596
269
2822
3321
4049
5198
5483
5672
6503
7005
2493
3204
3450
5507
1290
188
2735
294
4473
5485
6791
6910
173
2014
2675
2797
3682
4011
4069
4361
4633
5795
6097
6628
685
7119
1628
251
2690
3138
3677
4394
5225
6246
6607
6665
1711
4501
5943
6071
6685
6765
6993
7089
2720
3673
3895
5042
5965
6775
7080
7260
1707
2482
3008
3037
4240
4338
4938
6409
7347
1578
2150
2319
2412
3390
3645
390
3944
4134
4678
4846
4899
5175
5642
6278
7068
1161
1192
1450
1770
1898
3211
3363
4746
5279
5354
5434
6480
6984
7146
131
2053
2174
2605
322
3690
3786
3828
474
5053
5058
5142
6120
6647
7140
1074
1185
2259
2805
4328
4714
5170
5661
5676
6030
6496
1039
1498
2015
2557
2815
3509
4713
6849
215
2333
3100
3183
4591
4674
5138
5432
6411
7472
1487
1617
189
2773
2890
31
3229
4389
4438
5312
5350
5453
5534
6844
6987
1434
1714
206
2302
2322
2368
3553
3559
3802
4084
4306
4474
5867
771
833
1034
1075
2464
2469
256
33
3480
3834
3927
4072
4726
6839
7526
815
909
968
999
1399
1893
2900
3993
4071
6865
6999
7220
2311
2418
2608
3135
3398
4359
4360
4613
5049
5250
7488
929
1123
1549
1975
2928
3287
3741
471
4920
5309
5729
6437
6813
1319
1337
2856
2869
3633
3865
3919
4009
4058
4204
436
563
5831
120
1558
1881
2868
3314
4588
4798
5024
5238
5372
6024
6209
6395
1703
1852
1912
2611
2816
3519
4445
4608
4830
5280
6207
6212
6226
6363
6479
6717
6761
813
2405
2441
2497
2668
2886
3601
3930
4085
4644
484
5465
5734
6082
6300
6373
6470
6505
6605
6789
7205
972
1203
1754
1776
2262
2344
255
2961
3205
4489
480
51
5579
6653
7270
7315
2618
3486
3575
3840
4027
4773
5323
5355
5451
6648
7511
1001
108
1781
2542
2643
2750
2850
3060
3156
3890
4045
4107
4634
5173
521
5524
5794
5820
594
6705
6752
6756
6793
6827
6970
7291
773
97
2175
2746
2817
2823
3145
329
3684
4888
568
6443
665
6703
6933
6944
754
840
0
102
1528
1834
2424
3970
5187
5265
567
6068
6081
6269
6755
6963
7337
786
111
1118
1330
1472
205
2326
3024
3091
3122
3448
4179
434
4426
5496
6048
608
6676
7024
7054
7323
1505
1937
2051
2092
2118
243
3525
4047
4136
5143
5412
5490
5645
5879
6540
6568
7302
7437
846
966
1147
2481
2676
2871
2907
2962
3082
3291
3372
3439
3688
4384
4825
4828
5313
5528
5577
5707
5832
5987
7007
7463
1293
1597
170
1979
2305
2843
2895
3730
376
3926
4632
4765
4905
655
7092
7201
77
1131
1222
2186
2361
2861
3341
353
3799
4102
4387
4414
4600
5364
5675
5817
6577
776
934
1237
1368
2016
2372
2536
2569
2654
2916
2954
3968
4101
4253
475
4855
4943
5539
609
6138
6213
626
6315
6824
7132
7133
7307
925
1113
2340
2711
282
2836
291
3452
3637
39
4121
4309
4415
4452
4815
5038
5065
5148
559
5845
601
6260
6336
6532
6803
7143
7476
905
1240
1922
1996
2158
2303
2462
2982
3142
3195
3316
3751
3962
4210
4336
451
4668
4727
4839
4869
493
5314
6339
6383
6524
6797
914
114
1591
1765
1804
1845
2137
2159
2436
262
3353
3410
3470
3803
3963
4115
4443
467
5164
5643
5670
5893
6010
6344
6634
664
6763
6766
6776
694
7130
855
1183
1321
1484
1507
1709
1772
1808
1962
2018
2034
2759
3187
3386
4320
4552
4573
4602
4687
4915
5386
5553
5740
5784
6131
6368
6465
6476
6698
7297
928
1204
121
1249
1261
1408
1488
1581
161
1944
1957
2624
2826
3244
3303
3539
3748
3817
3820
4146
4318
4800
4964
5002
5378
5569
5742
575
6086
6114
6251
6276
630
6935
716
7413
800
834
860
882
1312
1491
1689
2001
2009
2476
28
3546
375
4091
4425
4453
4537
4684
4860
4948
5199
5299
5329
5390
5934
625
6826
7063
7107
7218
7242
7273
7372
7522
1069
1133
1444
1501
1875
1895
236
2452
2882
3543
3656
3760
3839
3879
3985
402
4195
4247
44
4733
4804
4849
488
5343
5904
5919
6044
6270
6456
6498
6808
6901
7087
7402
784
90
985
1683
2050
2645
2909
308
3642
3671
4551
4666
4735
5030
5319
5946
6343
650
6516
6836
6872
6953
989
1427
2206
2417
2553
2577
271
2837
2981
3118
3230
3638
388
3995
4292
4421
4457
4502
4579
5248
5771
6230
6489
6923
6975
7172
769
96
1282
1310
1393
1430
1788
1797
1824
1930
2552
27
2725
3050
348
3584
3587
374
3877
3906
4064
4747
4754
5075
5294
5327
552
6034
6310
6555
6691
6891
7041
7287
735
7376
801
2085
2177
2281
237
2386
241
2520
2573
2651
2904
3029
371
4235
4264
4319
4706
4980
5035
5103
5172
5318
5849
6179
640
6422
6572
7262
7538
1020
1187
1354
1904
2037
2625
3849
392
410
4303
4772
4791
5359
5973
6299
6492
661
6742
6873
7030
7503
7549
1349
1560
1830
1862
210
2292
2403
2459
273
2760
2960
3288
3339
3678
3726
3858
4170
4182
4629
4972
5021
5031
5073
5267
5358
5458
5626
5700
5759
6042
6201
649
658
6586
6687
6774
7322
7351
7407
86
92
935
1167
1359
1420
1439
1446
1687
2084
2360
2451
2678
2813
2949
3014
3174
3475
4039
4075
4138
437
4532
511
5112
5196
5275
5365
5557
5852
63
6317
6801
6942
7040
7165
725
1150
1224
1318
1438
1503
153
1983
199
2040
2245
2276
2387
259
2885
2932
3077
310
3467
362
3953
4099
4212
4283
4398
4527
4563
4593
4616
4823
4886
4913
5045
5222
5414
5463
5682
5757
576
6098
616
6268
6468
6495
6523
6554
6593
6642
6879
7002
705
7104
7217
7278
7325
7429
1
1021
1202
129
1552
160
1649
1723
2199
2258
2264
2430
2467
2518
2742
3069
3264
3382
3387
3389
3432
3629
3639
3672
3861
3863
3874
4044
4054
4154
4222
4251
4511
4803
4900
4947
5077
5180
5230
5346
5356
5701
5878
589
595
598
6273
6351
6354
638
6553
6711
6743
6851
7174
7249
7390
7397
7482
7518
766
969
1098
1372
1429
1464
1530
1568
1644
1967
2142
2246
2263
2280
2338
2433
2671
2753
2921
2948
2989
3123
319
3222
3293
3302
3350
3498
3555
3640
3701
3892
3989
4162
4252
4331
4518
4601
4965
5245
5268
5611
5629
5665
5711
5830
5866
618
629
6425
66
6907
7004
7020
7072
7211
7319
7358
7415
7418
1052
1114
1138
1269
1748
1820
1926
1945
2128
2215
2516
2589
2600
2694
2700
274
2844
2860
2881
298
306
3085
3089
3199
3402
3434
3612
3702
4019
4056
4087
4140
4286
4332
4339
4388
4488
4838
522
5236
537
5437
5516
5587
5599
5976
6109
6145
6222
6353
6442
6550
6558
6623
6657
68
692
7085
7193
7253
7268
7382
7401
787
819
842
865
1095
1119
1135
1238
1403
1574
1584
1886
1911
2122
2180
2216
224
2314
2442
2532
2579
2588
2617
2744
2854
2888
3074
3250
3520
3564
3593
3632
3663
3675
3738
3789
3979
4076
4346
4540
4656
4701
4813
4818
49
4945
4977
4994
506
5224
5232
5253
5756
5782
5809
5846
5875
5888
6170
6215
6349
6410
6592
6599
6619
6652
6700
6767
6823
6876
6948
6969
71
7145
7367
7481
7521
792
807
931
1009
1094
1155
1244
1369
1418
1495
1520
1795
1798
1836
2002
2143
2165
2251
2324
2325
2357
2375
2388
2767
2997
3191
3490
3704
3798
3810
3885
3891
4024
4043
4100
4161
4192
4244
4370
4524
4577
4724
477
4807
4810
4883
4890
5015
5146
524
5240
5244
5373
5394
5447
5853
5859
5991
6061
6146
6330
6367
6399
6413
6446
6449
6547
6548
6645
6672
6716
6814
6853
689
6927
7246
7269
7280
7308
7343
7348
7352
748
7487
825
1035
109
11
1115
1136
1153
1169
1229
1322
1329
1392
1455
1521
1554
1561
1577
1600
1659
1766
1773
179
1800
1896
1955
1968
1982
1990
2101
2171
2176
2343
2385
2488
2628
2872
2994
3031
3035
3180
3201
3279
3463
356
3621
3658
3774
3853
3996
4073
4156
4224
4345
4393
4404
4435
4470
4495
4571
4631
4673
4710
4734
4863
4868
4881
5012
5023
5068
508
5161
5320
5357
5419
5454
55
5559
5749
5844
5911
6148
6159
6186
6196
6241
633
6412
6451
6494
6519
6721
683
6859
6967
6978
7166
7233
7259
7281
7284
7321
7431
7435
7450
828
904
997
1024
1064
113
1197
1226
1300
1303
1376
1473
1548
1624
163
1665
1692
1708
1786
1799
1942
1989
2062
2077
2108
2116
2242
229
2301
2323
2574
2650
2801
2887
2906
2969
2971
3001
3033
3171
333
3337
3365
3367
3380
3437
3471
3491
3497
351
3514
3599
3609
3619
3685
3752
381
3880
3881
3884
3904
391
4028
4086
4111
4271
441
4427
444
4456
4535
4554
460
4621
4711
4770
4787
4806
4840
4959
5069
5078
5104
5110
5132
5135
5140
5301
5400
5427
5462
549
5564
5565
5630
5633
5654
5699
5710
5745
5763
5764
5768
5800
585
5863
5891
5916
5953
5958
5985
5992
6053
6076
6180
6210
6312
6332
636
6381
6421
6426
6464
6484
6585
6589
6709
6719
6794
680
6860
6979
6990
7298
7355
7379
7484
7524
814
984
991
1134
1143
1194
1207
1259
130
1301
1316
1340
1437
1447
1523
1539
1589
1655
1663
1673
1771
1790
1876
1918
1969
1971
2010
2013
2059
2093
2095
2135
2204
221
2213
2238
2277
2287
2294
2298
2312
2317
2353
2383
2414
2517
2544
2548
2585
2630
2677
2704
272
278
2802
2824
2833
2877
2883
2977
3092
3098
3102
3164
3197
3245
3261
3301
3333
3378
3399
3505
3552
3589
3635
3697
37
3761
3768
3777
379
3830
3841
3932
3942
3950
4010
4020
4112
4113
4116
412
4127
4129
4141
4160
4187
4226
4246
4284
4290
4322
4352
4379
4465
4523
4546
4564
4570
46
4605
4661
4665
4685
4769
4795
497
5029
5060
5083
516
520
5204
5252
526
5260
5283
5290
5302
5307
5321
5324
5446
5464
5523
5568
5730
5747
5748
5760
5766
5798
597
5982
5996
6006
6021
6051
6077
6080
6132
6136
6152
6169
624
6253
6280
6282
6376
6378
6384
6394
6416
6438
6566
6597
6626
6629
666
6670
6732
6747
6778
6816
687
6911
6926
6938
6951
701
7018
7070
7076
717
7178
7209
7231
7247
7267
7271
7276
7279
7290
7293
7316
7320
7331
7388
7427
7428
7430
7439
7443
7466
7474
759
775
808
836
867
87
937
942
947
995
1015
1019
1026
1027
1049
1054
1079
1085
1091
1106
1156
1228
1233
1253
1280
1288
1331
1333
1338
1371
1381
1385
1415
1454
1463
1476
1477
1479
148
15
1513
1534
155
1551
1583
1585
1602
1607
1612
1621
1668
1675
1701
172
1729
1738
1774
1784
1825
183
1841
1850
186
1927
1992
200
2020
2041
2066
2074
2075
2082
2086
2094
21
2148
2153
2157
2173
2193
2201
223
2235
2256
2269
2270
2295
2306
2342
2349
2355
2362
2371
2373
2416
2445
2509
2533
2554
2593
2619
2660
2666
2681
2684
2715
2719
2723
2747
275
2779
279
2790
2807
2845
2858
2889
2896
2959
30
3026
309
311
3114
3119
3149
3162
3163
3165
3185
3210
3224
3252
3256
3259
3269
3274
328
3281
3282
3292
3296
3305
331
3322
3352
3356
3358
3384
3401
3405
3421
3429
3431
3446
3460
3473
3502
3513
3516
3524
3532
3548
3574
3582
3594
363
3674
3687
3699
3712
3773
3790
3831
3846
3852
3872
3888
3898
3909
3913
3928
396
398
3981
401
4013
4067
409
41
4132
4135
4147
4201
4208
4228
423
4238
4256
4259
4277
4281
4296
4308
4316
4325
4367
4371
4391
4400
4406
4432
4446
4447
446
4463
4468
4472
4503
4520
454
4566
458
4594
4622
4637
4645
4664
4669
4672
4688
4698
47
4708
4725
4764
4808
4816
4820
4833
4891
491
494
5009
5014
5027
5044
5061
5070
5072
5090
5100
5116
5124
5126
5141
5157
5158
5167
5185
5216
5218
5285
5326
538
5408
542
5439
5449
5455
5508
5509
5531
5550
5570
5585
5597
5712
5737
5828
5833
5841
5843
5871
5912
5923
593
5930
5983
6069
6072
6075
6168
6172
6183
6205
6216
6224
6274
6291
6302
6306
6320
6403
6432
6452
6466
6478
6598
6603
6612
6620
6655
6699
6710
6723
6724
6728
6745
6792
6841
6863
6884
6915
6925
6943
6945
6997
7009
702
703
7035
7052
7053
7071
7090
7102
7112
7113
7136
7173
719
7195
723
7232
726
7263
7264
73
7314
7338
737
7374
738
7384
7386
7438
7456
7460
7471
7489
7504
829
849
85
861
874
876
880
9
906
923
990
992
